Reports/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистБазовойВыручки</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистСебестоимости</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
</mdclass:Report>

AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/ТипыЦенПоГруппамНоменклатурыДляПокупателей/ТипыЦенПоГруппамНоменклатурыДляПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТипыЦенПоГруппамНоменклатурыДляПокупателей</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_СкидкиОтБазовыеЦены/Лео_СкидкиОтБазовыеЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_СкидкиОтБазовыеЦены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СтатуснаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяСкидка</name>
    <comment>Дополнительная скидка (за предоплату), (применяется последовательно 1.1.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусныйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СкидкаКомпенсирующаяПремию</name>
    <comment>Скидка, компенсирующая премию (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиЛогистики</name>
    <comment>Скидка за услуги логистики (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиТорговогоМаркетинга</name>
    <comment>Скидка за услуги торгового маркетинга (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиМерчендайзинга</name>
    <comment>Скидка за услуги мерчендайзинга (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаПрочиеУслугиПоДоговору</name>
    <comment>Скидка за прочие услуги по договору (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипЦенСоСкидкой</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Enums/СпособыРасчетаЦены/СпособыРасчетаЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаЦены</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ПоПроцентнойНаценкеНаБазовыйТип</name>
  </enumValues>
  <enumValues>
    <name>ПоВхождениюБазовойЦеныВДиапазон</name>
  </enumValues>
</mdclass:Enum>

Catalogs/ТипыЦенНоменклатуры/ТипыЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦенНоменклатуры</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитывается</name>
    <comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>(Общ) Истина - цена включает НДС, ложь - не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <comment>(Общ) Истина, то при порядке округления &quot;5&quot; 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </attributes>
</mdclass:Catalog>

Reports/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ/ObjectModule.bsl
Процедура СформироватьОтчет() Экспорт
	
	ЕстьОшибки = Ложь;
	Если Не ЗначениеЗаполнено(ДатаС) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата отчета");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата отчета");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПрайсЛистБазовойВыручки) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан Прайс лист базовой выручки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипГруппировки) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан тип группировки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПрайсЛистСебестоимости) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан Прайс лист себестоимости");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Очистить();
	УстановитьПривилегированныйРежим(Истина); 
	
	Макет = ЭтотОбъект.ПолучитьМакет("РПЛ");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяЗапись");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) КАК Дата,
		|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализация,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаС И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|	И РеализацияТоваровУслуг.Ссылка.Проведен = ИСТИНА
		|	И РеализацияТоваровУслуг.Ссылка.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
		|	И НЕ РеализацияТоваровУслуг.Контрагент.абс_БизнесРегион.Наименование = ""ВНУТРЕННИЕ""
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборКонтрагент
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслуг.Контрагент В (&Контрагент)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборОтдел 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслуг.Контрагент.абс_Отдел В (&Отдел)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборБизнесРегион 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслуг.Контрагент.абс_БизнесРегион В (&БизнесРегион)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента,
		|	КОНЕЦПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ),
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.ДоговорКонтрагента
		|ИЗ
		|	(ВЫБРАТЬ
		|		Продажи.Регистратор КАК Регистратор,
		|		Продажи.Период КАК Период,
		|		Продажи.ДоговорКонтрагента КАК ДоговорКонтрагента
		|	ИЗ
		|		РегистрНакопления.Продажи КАК Продажи
		|	ГДЕ
		|		Продажи.Период МЕЖДУ &ДатаС И &ДатаПо
		|		И Продажи.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|		И НЕ Продажи.ДокументПродажи.Контрагент.абс_БизнесРегион.Наименование = ""ВНУТРЕННИЕ""
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборКонтрагент 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент В (&Контрагент)
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборОтдел 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент.абс_Отдел В (&Отдел)
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборБизнесРегион 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент.абс_БизнесРегион В (&БизнесРегион)
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Продажи.Регистратор,
		|		Продажи.Период,
		|		Продажи.ДоговорКонтрагента) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) КАК Дата,
		|	РеализацияТоваровУслугТовары.Ссылка.Организация,
		|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
		|	РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента КАК Договор,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.Цена,
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		|				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	РеализацияТоваровУслугТовары.СтавкаНДС,
		|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		|ПОМЕСТИТЬ ВТ_РеализацииТовары
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаС И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И РеализацияТоваровУслугТовары.Ссылка.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка.Контрагент.абс_БизнесРегион.Наименование = ""ВНУТРЕННИЕ""
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборКонтрагент 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Контрагент В (&Контрагент)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборОтдел 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Контрагент.абс_Отдел В (&Отдел)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборБизнесРегион 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.Контрагент.абс_БизнесРегион В (&БизнесРегион)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка.Дата,
		|	РеализацияТоваровУслугТовары.Ссылка.Организация,
		|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
		|	РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		|	РеализацияТоваровУслугТовары.Цена,
		|	РеализацияТоваровУслугТовары.СтавкаНДС,
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС,
		|	КОНЕЦПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ),
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДоговорКонтрагента,
		|	ВложенныйЗапрос.Номенклатура,
		|	NULL,
		|	СУММА(ВложенныйЗапрос.Количество),
		|	NULL,
		|	СУММА(ВложенныйЗапрос.СуммаКорректировки),
		|	NULL,
		|	СУММА(ВложенныйЗапрос.НДС),
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.РегистраторСуммаВключаетНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Продажи.Номенклатура КАК Номенклатура,
		|		Продажи.Контрагент КАК Контрагент,
		|		СУММА(Продажи.Количество) КАК Количество,
		|		СУММА(Продажи.Стоимость - Продажи.НДС) КАК СуммаКорректировки,
		|		Продажи.Регистратор КАК Регистратор,
		|		Продажи.Организация КАК Организация,
		|		Продажи.Период КАК Период,
		|		Продажи.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		СУММА(Продажи.НДС) КАК НДС,
		|		Продажи.Регистратор.СуммаВключаетНДС КАК РегистраторСуммаВключаетНДС
		|	ИЗ
		|		РегистрНакопления.Продажи КАК Продажи
		|	ГДЕ
		|		Продажи.Период МЕЖДУ &ДатаС И &ДатаПо
		|		И Продажи.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|		И НЕ Продажи.ДокументПродажи.Контрагент.абс_БизнесРегион.Наименование = ""ВНУТРЕННИЕ""
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборКонтрагент 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент В (&Контрагент)
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборОтдел 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент.абс_Отдел В (&Отдел)
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА НЕ &ОтборБизнесРегион 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Продажи.Контрагент.абс_БизнесРегион В (&БизнесРегион)
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Продажи.Регистратор,
		|		Продажи.Контрагент,
		|		Продажи.Номенклатура,
		|		Продажи.Организация,
		|		Продажи.Период,
		|		Продажи.ДоговорКонтрагента,
		|		Продажи.Регистратор.СуммаВключаетНДС) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДоговорКонтрагента,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.РегистраторСуммаВключаетНДС,
		|	КОНЕЦПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.СерияНоменклатуры,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Цена,
		|	ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки,
		|	ВложенныйЗапрос.абс_СуммаРучнойСкидки,
		|	ВложенныйЗапрос.Лео_ЦенаСУчетомСкидки,
		|	ВложенныйЗапрос.Лео_СуммаОкругляющейСкидки,
		|	ВложенныйЗапрос.Лео_ТипРучнойСкидки,
		|	ВложенныйЗапрос.Лео_НачалоПериодаВозникновенияРасхода,
		|	ВложенныйЗапрос.ЗаказПокупателя,
		|	ВложенныйЗапрос.АвтоматическаяСкидка,
		|	ВложенныйЗапрос.АвтоматическаяСкидкаКомментарий,
		|	ВложенныйЗапрос.абс_КомментарийРучнойСкидки
		|ПОМЕСТИТЬ ВТ_ДанныеЗаказа
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|		ЗаказПокупателяТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|		СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|		ЗаказПокупателяТовары.Цена КАК Цена,
		|		СУММА(ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки) КАК абс_СуммаАвтоматическойСкидки,
		|		СУММА(ЗаказПокупателяТовары.абс_СуммаРучнойСкидки) КАК абс_СуммаРучнойСкидки,
		|		ЗаказПокупателяТовары.Лео_ЦенаСУчетомСкидки КАК Лео_ЦенаСУчетомСкидки,
		|		СУММА(ЗаказПокупателяТовары.Лео_СуммаОкругляющейСкидки) КАК Лео_СуммаОкругляющейСкидки,
		|		ЗаказПокупателяТовары.Лео_ТипРучнойСкидки КАК Лео_ТипРучнойСкидки,
		|		ЗаказПокупателяТовары.Лео_НачалоПериодаВозникновенияРасхода КАК Лео_НачалоПериодаВозникновенияРасхода,
		|		МАКСИМУМ(АвтоматическиеСкидкиВЗаказе.Скидка) КАК АвтоматическаяСкидка,
		|		МАКСИМУМ(АвтоматическиеСкидкиВЗаказе.Комментарий) КАК АвтоматическаяСкидкаКомментарий,
		|		ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
		|		ВЫРАЗИТЬ(ЗаказПокупателяТовары.абс_КомментарийРучнойСкидки КАК СТРОКА(300)) КАК абс_КомментарийРучнойСкидки
		|	ИЗ
		|		ВТ_Реализации КАК ВТ_Реализации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗаказПокупателяабс_СкидкиНаценки.Ссылка КАК ЗаказПокупателя,
		|					МАКСИМУМ(ЗаказПокупателяабс_СкидкиНаценки.Скидка) КАК Скидка,
		|					МАКСИМУМ(ВЫРАЗИТЬ(ЗаказПокупателяабс_СкидкиНаценки.Комментарий КАК СТРОКА(250))) КАК Комментарий,
		|					УстановкаСкидокНоменклатурыТовары.Номенклатура КАК Номенклатура
		|				ИЗ
		|					ВТ_Реализации КАК ВТ_Реализации
		|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.абс_СкидкиНаценки КАК ЗаказПокупателяабс_СкидкиНаценки
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокНоменклатуры.Товары КАК УстановкаСкидокНоменклатурыТовары
		|							ПО ЗаказПокупателяабс_СкидкиНаценки.Скидка = УстановкаСкидокНоменклатурыТовары.Ссылка
		|						ПО ВТ_Реализации.ДокументРеализация.Сделка = ЗаказПокупателяабс_СкидкиНаценки.Ссылка
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ЗаказПокупателяабс_СкидкиНаценки.Ссылка,
		|					УстановкаСкидокНоменклатурыТовары.Номенклатура) КАК АвтоматическиеСкидкиВЗаказе
		|				ПО ЗаказПокупателяТовары.Ссылка = АвтоматическиеСкидкиВЗаказе.ЗаказПокупателя
		|					И ЗаказПокупателяТовары.Номенклатура = АвтоматическиеСкидкиВЗаказе.Номенклатура
		|			ПО ВТ_Реализации.ДокументРеализация.Сделка = ЗаказПокупателяТовары.Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказПокупателяТовары.Номенклатура,
		|		ЗаказПокупателяТовары.СерияНоменклатуры,
		|		ЗаказПокупателяТовары.Лео_ТипРучнойСкидки,
		|		ЗаказПокупателяТовары.Лео_НачалоПериодаВозникновенияРасхода,
		|		ЗаказПокупателяТовары.Ссылка,
		|		ЗаказПокупателяТовары.Цена,
		|		ЗаказПокупателяТовары.Лео_ЦенаСУчетомСкидки,
		|		ВЫРАЗИТЬ(ЗаказПокупателяТовары.абс_КомментарийРучнойСкидки КАК СТРОКА(300))) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальнаяДатаТипаЦенПоДоговору.ДоговорКонтрагента,
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателей.ТипЦен,
		|	МаксимальнаяДатаТипаЦенПоДоговору.Дата
		|ПОМЕСТИТЬ ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Реализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		КОНЕЦПЕРИОДА(ВТ_Реализации.ДокументРеализация.Сделка.Дата, ДЕНЬ) КАК Дата,
		|		МАКСИМУМ(ТипыЦенПоГруппамНоменклатурыДляПокупателей.Период) КАК Период
		|	ИЗ
		|		ВТ_Реализации КАК ВТ_Реализации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей КАК ТипыЦенПоГруппамНоменклатурыДляПокупателей
		|			ПО ВТ_Реализации.ДоговорКонтрагента = ТипыЦенПоГруппамНоменклатурыДляПокупателей.абс_ДоговорКонтрагента
		|				И ВТ_Реализации.Дата >= ТипыЦенПоГруппамНоменклатурыДляПокупателей.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Реализации.ДоговорКонтрагента,
		|		КОНЕЦПЕРИОДА(ВТ_Реализации.ДокументРеализация.Сделка.Дата, ДЕНЬ)) КАК МаксимальнаяДатаТипаЦенПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей КАК ТипыЦенПоГруппамНоменклатурыДляПокупателей
		|		ПО МаксимальнаяДатаТипаЦенПоДоговору.ДоговорКонтрагента = ТипыЦенПоГруппамНоменклатурыДляПокупателей.абс_ДоговорКонтрагента
		|			И МаксимальнаяДатаТипаЦенПоДоговору.Период = ТипыЦенПоГруппамНоменклатурыДляПокупателей.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальнаяДатаТипаЦенПоДоговору.ДоговорКонтрагента,
		|	МаксимальнаяДатаТипаЦенПоДоговору.Дата,
		|	Лео_СкидкиОтБазовыеЦены.ТипЦенСоСкидкой,
		|	Лео_СкидкиОтБазовыеЦены.СтатуснаяСкидка,
		|	Лео_СкидкиОтБазовыеЦены.ДополнительнаяСкидка,
		|	Лео_СкидкиОтБазовыеЦены.СкидкаКомпенсирующаяПремию,
		|	Лео_СкидкиОтБазовыеЦены.СкидкаЗаУслугиЛогистики,
		|	Лео_СкидкиОтБазовыеЦены.СкидкаЗаУслугиТорговогоМаркетинга,
		|	Лео_СкидкиОтБазовыеЦены.СкидкаЗаУслугиМерчендайзинга,
		|	Лео_СкидкиОтБазовыеЦены.СкидкаЗаПрочиеУслугиПоДоговору,
		|	Лео_СкидкиОтБазовыеЦены.БазовыйТипЦен
		|ПОМЕСТИТЬ ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Реализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		КОНЕЦПЕРИОДА(ВТ_Реализации.ДокументРеализация.Сделка.Дата, ДЕНЬ) КАК Дата,
		|		МАКСИМУМ(Лео_СкидкиОтБазовыеЦены.Период) КАК Период
		|	ИЗ
		|		ВТ_Реализации КАК ВТ_Реализации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лео_СкидкиОтБазовыеЦены КАК Лео_СкидкиОтБазовыеЦены
		|			ПО ВТ_Реализации.ДоговорКонтрагента = Лео_СкидкиОтБазовыеЦены.Договор
		|				И ВТ_Реализации.ДокументРеализация.Сделка.Дата >= Лео_СкидкиОтБазовыеЦены.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Реализации.ДоговорКонтрагента,
		|		КОНЕЦПЕРИОДА(ВТ_Реализации.ДокументРеализация.Сделка.Дата, ДЕНЬ)) КАК МаксимальнаяДатаТипаЦенПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лео_СкидкиОтБазовыеЦены КАК Лео_СкидкиОтБазовыеЦены
		|		ПО МаксимальнаяДатаТипаЦенПоДоговору.Период = Лео_СкидкиОтБазовыеЦены.Период
		|			И МаксимальнаяДатаТипаЦенПоДоговору.ДоговорКонтрагента = Лео_СкидкиОтБазовыеЦены.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.ТипЦен
		|ПОМЕСТИТЬ ВТ_НоменклатураТипЦенДаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Номенклатура КАК Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) КАК Дата,
		|		ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ТипЦен КАК ТипЦен
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок КАК ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок
		|			ПО ВТ_РеализацииТовары.Договор = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ДоговорКонтрагента
		|				И (КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ),
		|		ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ТипЦен.БазовыйТипЦен
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок КАК ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок
		|			ПО ВТ_РеализацииТовары.Договор = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ДоговорКонтрагента
		|				И (КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Дата, ДЕНЬ),
		|		МАКСИМУМ(&ОбщийБазовыйПрайсЛист)
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|	ГДЕ
		|		НЕ &ОбщийБазовыйПрайсЛист = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.Пустаяссылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Дата, ДЕНЬ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ),
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.БазовыйТипЦен
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок КАК ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок
		|			ПО ВТ_РеализацииТовары.Договор = ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ДоговорКонтрагента
		|				И (КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) = ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ДанныеЗаказа.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_ДанныеЗаказа.ЗаказПокупателя.Дата, ДЕНЬ),
		|		ВТ_ДанныеЗаказа.ЗаказПокупателя.ТипЦен
		|	ИЗ
		|		ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Дата, ДЕНЬ),
		|		МАКСИМУМ(&СебестоимостьПрайсЛист)
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|	ГДЕ
		|		НЕ &ОбщийБазовыйПрайсЛист = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.Пустаяссылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_РеализацииТовары.Номенклатура,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Дата, ДЕНЬ)) КАК ВложенныйЗапрос
		|ГДЕ
		|	НЕ ВложенныйЗапрос.ТипЦен ЕСТЬ NULL 
		|	И НЕ ВложенныйЗапрос.ТипЦен = ЗНАЧЕНИЕ(справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальнаяДатаТипЦенНоменклатура.Номенклатура,
		|	МаксимальнаяДатаТипЦенНоменклатура.Дата,
		|	МаксимальнаяДатаТипЦенНоменклатура.ТипЦен,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_СрезЦенПоТипуЦен
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_НоменклатураТипЦенДаты.Номенклатура КАК Номенклатура,
		|		ВТ_НоменклатураТипЦенДаты.Дата КАК Дата,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен КАК ТипЦен,
		|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
		|	ИЗ
		|		ВТ_НоменклатураТипЦенДаты КАК ВТ_НоменклатураТипЦенДаты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|			ПО ВТ_НоменклатураТипЦенДаты.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|				И ВТ_НоменклатураТипЦенДаты.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|				И ВТ_НоменклатураТипЦенДаты.Дата >= ЦеныНоменклатуры.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_НоменклатураТипЦенДаты.Номенклатура,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен,
		|		ВТ_НоменклатураТипЦенДаты.Дата) КАК МаксимальнаяДатаТипЦенНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО МаксимальнаяДатаТипЦенНоменклатура.Период = ЦеныНоменклатуры.Период
		|			И МаксимальнаяДатаТипЦенНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И МаксимальнаяДатаТипЦенНоменклатура.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|ГДЕ
		|	НЕ МаксимальнаяДатаТипЦенНоменклатура.ТипЦен.Рассчитывается = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.СерияНоменклатуры,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Цена,
		|	ВложенныйЗапрос.СуммаРучнойСкидки,
		|	ВложенныйЗапрос.СуммаОкругляющейСкидки,
		|	ВложенныйЗапрос.ТипРучнойСкидки,
		|	ВложенныйЗапрос.НачалоПериодаВозникновенияРасхода,
		|	ВложенныйЗапрос.ЗаказПокупателя,
		|	ВложенныйЗапрос.КомментарийРучнойСкидки,
		|	ВложенныйЗапрос.Контрагент
		|ПОМЕСТИТЬ ВТ_СкидкаПоДатеВозникновениярасхода
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|		ЗаказПокупателяТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|		СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|		ЗаказПокупателяТовары.Цена КАК Цена,
		|		СУММА(ЗаказПокупателяТовары.абс_СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
		|		СУММА(ЗаказПокупателяТовары.Лео_СуммаОкругляющейСкидки) КАК СуммаОкругляющейСкидки,
		|		ЗаказПокупателяТовары.Лео_ТипРучнойСкидки КАК ТипРучнойСкидки,
		|		ЗаказПокупателяТовары.Лео_НачалоПериодаВозникновенияРасхода КАК НачалоПериодаВозникновенияРасхода,
		|		ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
		|		ВЫРАЗИТЬ(ЗаказПокупателяТовары.абс_КомментарийРучнойСкидки КАК СТРОКА(300)) КАК КомментарийРучнойСкидки,
		|		ЗаказПокупателяТовары.Ссылка.Контрагент КАК Контрагент
		|	ИЗ
		|		Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|	ГДЕ
		|		ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|		И ЗаказПокупателяТовары.Лео_НачалоПериодаВозникновенияРасхода МЕЖДУ &ДатаС И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|		И ЗаказПокупателяТовары.Ссылка.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказПокупателяТовары.Номенклатура,
		|		ЗаказПокупателяТовары.СерияНоменклатуры,
		|		ЗаказПокупателяТовары.Цена,
		|		ЗаказПокупателяТовары.Лео_ТипРучнойСкидки,
		|		ЗаказПокупателяТовары.Лео_НачалоПериодаВозникновенияРасхода,
		|		ЗаказПокупателяТовары.Ссылка,
		|		ВЫРАЗИТЬ(ЗаказПокупателяТовары.абс_КомментарийРучнойСкидки КАК СТРОКА(300)),
		|		ЗаказПокупателяТовары.Ссылка.Контрагент) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.ТипЦен,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВложенныйЗапрос.ТипЦенПорядокОкругления = ЗНАЧЕНИЕ(перечисление.ПорядкиОкругления.Окр0_01)
		|				ТОГДА ВЫБОР
		|						КОГДА ВложенныйЗапрос.ТипЦенСпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
		|							ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_СрезЦенПоТипуЦен.Цена, 0) * (1 + ВложенныйЗапрос.ТипЦенПроцентСкидкиНаценки / 100) КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВложенныйЗапрос.ТипЦенСпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
		|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_СрезЦенПоТипуЦен.Цена, 0) * (1 + ВложенныйЗапрос.ТипЦенПроцентСкидкиНаценки / 100) КАК ЧИСЛО(15, 1))
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_НоменклатураТипЦенДаты.Номенклатура КАК Номенклатура,
		|		ВТ_НоменклатураТипЦенДаты.Дата КАК Дата,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен КАК ТипЦен,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.БазовыйТипЦен КАК ТипЦенБазовыйТипЦен,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ПроцентСкидкиНаценки КАК ТипЦенПроцентСкидкиНаценки,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ПорядокОкругления КАК ТипЦенПорядокОкругления,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ОкруглятьВБольшуюСторону КАК ТипЦенОкруглятьВБольшуюСторону,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.СпособРасчетаЦены КАК ТипЦенСпособРасчетаЦены
		|	ИЗ
		|		ВТ_НоменклатураТипЦенДаты КАК ВТ_НоменклатураТипЦенДаты
		|	ГДЕ
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.Рассчитывается = ИСТИНА
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_НоменклатураТипЦенДаты.Номенклатура,
		|		ВТ_НоменклатураТипЦенДаты.Дата,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.БазовыйТипЦен,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ПроцентСкидкиНаценки,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ПорядокОкругления,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.ОкруглятьВБольшуюСторону,
		|		ВТ_НоменклатураТипЦенДаты.ТипЦен.СпособРасчетаЦены) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезЦенПоТипуЦен КАК ВТ_СрезЦенПоТипуЦен
		|		ПО ВложенныйЗапрос.ТипЦенБазовыйТипЦен = ВТ_СрезЦенПоТипуЦен.ТипЦен
		|			И ВложенныйЗапрос.Дата = ВТ_СрезЦенПоТипуЦен.Дата
		|			И ВложенныйЗапрос.Номенклатура = ВТ_СрезЦенПоТипуЦен.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.ТипЦен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СрезЦенПоТипуЦен.Номенклатура,
		|	ВТ_СрезЦенПоТипуЦен.Дата,
		|	ВТ_СрезЦенПоТипуЦен.ТипЦен,
		|	ВТ_СрезЦенПоТипуЦен.Цена
		|ИЗ
		|	ВТ_СрезЦенПоТипуЦен КАК ВТ_СрезЦенПоТипуЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.Договор,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.СерияНоменклатуры,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Цена КАК ЦенаРеализации,
		|	ВложенныйЗапрос.ФактическаяВыручка,
		|	ЕСТЬNULL(ВложенныйЗапрос.ЦенаЗаказа, 0) КАК ЦенаЗаказа,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаАвтоматическойСкидки, 0) КАК СуммаАвтоматическойСкидки,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаРучнойСкидки, 0) КАК СуммаРучнойСкидки,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаОкругляющейСкидки, 0) КАК СуммаОкругляющейСкидки,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТипРучнойСкидки, ЗНАЧЕНИЕ(Справочник.ТипыСкидокНаценок.ПустаяСсылка)) КАК ТипРучнойСкидки,
		|	ВложенныйЗапрос.НачалоПериодаВозникновенияРасхода,
		|	ЕСТЬNULL(ВложенныйЗапрос.АвтоматическаяСкидка, ЗНАЧЕНИЕ(Документ.УстановкаСкидокНоменклатуры.ПустаяСсылка)) КАК АвтоматическаяСкидка,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)) КАК ТипЦенПоДоговору,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныИтогПоЗаказу.Цена, 0) = 0
		|			ТОГДА ВложенныйЗапрос.Цена
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ЦеныИтогПоЗаказу.Цена, 0)
		|	КОНЕЦ КАК ЦенаПоДоговору,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныИтогБазовыйПрайс.Цена, 0) = 0
		|			ТОГДА ВложенныйЗапрос.Цена
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ЦеныИтогБазовыйПрайс.Цена, 0)
		|	КОНЕЦ КАК ЦенаОбщийБазовыйПрайсЛист,
		|	ЕСТЬNULL(ВТ_ЦеныИтогСебестоимостьИтог.Цена, 0) КАК ЦенаСебестоимости,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БазовыйиИзДоговора.Цена, 0) = 0
		|			ТОГДА ВложенныйЗапрос.Цена
		|		ИНАЧЕ ЕСТЬNULL(ВТ_БазовыйиИзДоговора.Цена, 0)
		|	КОНЕЦ КАК ЦенаБазовыйПоДоговору,
		|	ЕСТЬNULL(ВложенныйЗапрос.СтатуснаяСкидка, 0) КАК СтатуснаяСкидка,
		|	ЕСТЬNULL(ВложенныйЗапрос.ДополнительнаяСкидка, 0) КАК ДополнительнаяСкидка,
		|	ЕСТЬNULL(ВложенныйЗапрос.СкидкаКомпенсирующаяПремию, 0) КАК СкидкаКомпенсирующаяПремию,
		|	ЕСТЬNULL(ВложенныйЗапрос.СкидкаЗаУслугиЛогистики, 0) КАК СкидкаЗаУслугиЛогистики,
		|	ЕСТЬNULL(ВложенныйЗапрос.СкидкаЗаУслугиМерчендайзинга, 0) КАК СкидкаЗаУслугиМерчендайзинга,
		|	ЕСТЬNULL(ВложенныйЗапрос.СкидкаЗаУслугиТорговогоМаркетинга, 0) КАК СкидкаЗаУслугиТорговогоМаркетинга,
		|	ЕСТЬNULL(ВложенныйЗапрос.СкидкаЗаПрочиеУслугиПоДоговору, 0) КАК СкидкаЗаПрочиеУслугиПоДоговору,
		|	ВложенныйЗапрос.Реализация,
		|	ВложенныйЗапрос.ДатаЗаказа,
		|	ВложенныйЗапрос.ТипЦенЗаказа,
		|	ВложенныйЗапрос.ТипЦен КАК ТипЦенИзДоговора,
		|	ВложенныйЗапрос.БазовыйТипЦен,
		|	ВложенныйЗапрос.ТипЦенСоСкидкой,
		|	ВложенныйЗапрос.ТипЦенСоСкидкой.ПроцентСкидкиНаценки КАК ОбщийПроцентСкидкиПоУсловиямДоговора,
		|	ВложенныйЗапрос.Договор.ПроцентПредоплаты КАК ПроцентПредоплаты,
		|	ВложенныйЗапрос.Договор.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности,
		|	ВложенныйЗапрос.КомментарийРучнойСкидкиЗаказа,
		|	ВложенныйЗапрос.Количество * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЦеныИтогБазовыйПрайс.Цена, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_ЦеныИтогБазовыйПрайс.Цена, 0)
		|	КОНЕЦ КАК ВыручкаПоРПЛ,
		|	ВложенныйЗапрос.Количество * ЕСТЬNULL(ВТ_ЦеныИтогСебестоимостьИтог.Цена, 0) КАК ПроизводственнаяCебестоимость,
		|	ВложенныйЗапрос.Количество * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БазовыйиИзДоговора.Цена, 0) = 0
		|			ТОГДА ВложенныйЗапрос.Цена
		|		ИНАЧЕ ЕСТЬNULL(ВТ_БазовыйиИзДоговора.Цена, 0)
		|	КОНЕЦ - (ВложенныйЗапрос.ФактическаяВыручка + ЕСТЬNULL(ВложенныйЗапрос.СуммаАвтоматическойСкидки, 0) + ЕСТЬNULL(ВложенныйЗапрос.СуммаРучнойСкидки, 0) + ЕСТЬNULL(ВложенныйЗапрос.СуммаОкругляющейСкидки, 0)) КАК РасчетнаяСкидкаПоДоговору,
		|	ВТ_ЦеныИтогБазовыйПрайс.ТипЦен,
		|	ВТ_ЦеныИтогБазовыйПрайс.Цена
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_РеализацииТовары.Дата КАК Дата,
		|		ВТ_РеализацииТовары.Организация КАК Организация,
		|		ВТ_РеализацииТовары.Контрагент КАК Контрагент,
		|		ВТ_РеализацииТовары.Договор КАК Договор,
		|		ВТ_РеализацииТовары.Номенклатура КАК Номенклатура,
		|		ВТ_РеализацииТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|		СУММА(ВТ_РеализацииТовары.Количество) КАК Количество,
		|		ВТ_РеализацииТовары.Цена КАК Цена,
		|		СУММА(ВТ_РеализацииТовары.Сумма) КАК ФактическаяВыручка,
		|		ВТ_ДанныеЗаказа.Цена КАК ЦенаЗаказа,
		|		ВТ_ДанныеЗаказа.абс_СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|		ВТ_ДанныеЗаказа.абс_СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|		ВТ_ДанныеЗаказа.Лео_СуммаОкругляющейСкидки КАК СуммаОкругляющейСкидки,
		|		ВТ_ДанныеЗаказа.Лео_ТипРучнойСкидки КАК ТипРучнойСкидки,
		|		ВТ_ДанныеЗаказа.Лео_НачалоПериодаВозникновенияРасхода КАК НачалоПериодаВозникновенияРасхода,
		|		ВТ_ДанныеЗаказа.АвтоматическаяСкидка КАК АвтоматическаяСкидка,
		|		ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ТипЦен КАК ТипЦен,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ТипЦенСоСкидкой КАК ТипЦенСоСкидкой,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.БазовыйТипЦен КАК БазовыйТипЦен,
		|		ВТ_РеализацииТовары.Реализация КАК Реализация,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СтатуснаяСкидка КАК СтатуснаяСкидка,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ДополнительнаяСкидка КАК ДополнительнаяСкидка,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаКомпенсирующаяПремию КАК СкидкаКомпенсирующаяПремию,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиЛогистики КАК СкидкаЗаУслугиЛогистики,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиМерчендайзинга КАК СкидкаЗаУслугиМерчендайзинга,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиТорговогоМаркетинга КАК СкидкаЗаУслугиТорговогоМаркетинга,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаПрочиеУслугиПоДоговору КАК СкидкаЗаПрочиеУслугиПоДоговору,
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) КАК ДатаЗаказа,
		|		ВТ_РеализацииТовары.Реализация.Сделка.ТипЦен КАК ТипЦенЗаказа,
		|		ВЫРАЗИТЬ(ВТ_ДанныеЗаказа.абс_КомментарийРучнойСкидки КАК СТРОКА(300)) КАК КомментарийРучнойСкидкиЗаказа
		|	ИЗ
		|		ВТ_РеализацииТовары КАК ВТ_РеализацииТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
		|			ПО ВТ_РеализацииТовары.Реализация.Сделка = ВТ_ДанныеЗаказа.ЗаказПокупателя
		|				И ВТ_РеализацииТовары.Номенклатура = ВТ_ДанныеЗаказа.Номенклатура
		|				И ВТ_РеализацииТовары.СерияНоменклатуры = ВТ_ДанныеЗаказа.СерияНоменклатуры
		|				И ВТ_РеализацииТовары.Цена = ВТ_ДанныеЗаказа.Лео_ЦенаСУчетомСкидки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок КАК ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок
		|			ПО ВТ_РеализацииТовары.Договор = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ДоговорКонтрагента
		|				И (КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) = ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.Дата)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок КАК ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок
		|			ПО ВТ_РеализацииТовары.Договор = ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ДоговорКонтрагента
		|				И (КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ) = ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.Дата)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_РеализацииТовары.Дата,
		|		ВТ_РеализацииТовары.Организация,
		|		ВТ_РеализацииТовары.Контрагент,
		|		ВТ_РеализацииТовары.Договор,
		|		ВТ_РеализацииТовары.Номенклатура,
		|		ВТ_РеализацииТовары.СерияНоменклатуры,
		|		ВТ_РеализацииТовары.Цена,
		|		ВТ_ДанныеЗаказа.Цена,
		|		ВТ_ДанныеЗаказа.абс_СуммаАвтоматическойСкидки,
		|		ВТ_ДанныеЗаказа.абс_СуммаРучнойСкидки,
		|		ВТ_ДанныеЗаказа.Лео_СуммаОкругляющейСкидки,
		|		ВТ_ДанныеЗаказа.Лео_ТипРучнойСкидки,
		|		ВТ_ДанныеЗаказа.Лео_НачалоПериодаВозникновенияРасхода,
		|		ВТ_ДанныеЗаказа.АвтоматическаяСкидка,
		|		ВТ_СрезПоследихТиповЦенПоДоговорамНаДатуДок.ТипЦен,
		|		ВТ_РеализацииТовары.Реализация,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ТипЦенСоСкидкой,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СтатуснаяСкидка,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.ДополнительнаяСкидка,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаКомпенсирующаяПремию,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиЛогистики,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиМерчендайзинга,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаУслугиТорговогоМаркетинга,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.СкидкаЗаПрочиеУслугиПоДоговору,
		|		ВТ_СрезПоследихУсловийПоДоговорамНаДатуДок.БазовыйТипЦен,
		|		ВТ_РеализацииТовары.Реализация.Сделка.ТипЦен,
		|		ВЫРАЗИТЬ(ВТ_ДанныеЗаказа.абс_КомментарийРучнойСкидки КАК СТРОКА(300)),
		|		КОНЕЦПЕРИОДА(ВТ_РеализацииТовары.Реализация.Сделка.Дата, ДЕНЬ)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныИтог КАК ВТ_ЦеныИтогПоЗаказу
		|		ПО ВложенныйЗапрос.Номенклатура = ВТ_ЦеныИтогПоЗаказу.Номенклатура
		|			И ВложенныйЗапрос.ТипЦенЗаказа = ВТ_ЦеныИтогПоЗаказу.ТипЦен
		|			И ВложенныйЗапрос.ДатаЗаказа = ВТ_ЦеныИтогПоЗаказу.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныИтог КАК ВТ_ЦеныИтогБазовыйПрайс
		|		ПО ВложенныйЗапрос.Дата = ВТ_ЦеныИтогБазовыйПрайс.Дата
		|			И ВложенныйЗапрос.Номенклатура = ВТ_ЦеныИтогБазовыйПрайс.Номенклатура
		|			И (ВТ_ЦеныИтогБазовыйПрайс.ТипЦен = &ОбщийБазовыйПрайсЛист)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныИтог КАК ВТ_БазовыйиИзДоговора
		|		ПО ВложенныйЗапрос.Номенклатура = ВТ_БазовыйиИзДоговора.Номенклатура
		|			И ВложенныйЗапрос.ДатаЗаказа = ВТ_БазовыйиИзДоговора.Дата
		|			И ВложенныйЗапрос.БазовыйТипЦен = ВТ_БазовыйиИзДоговора.ТипЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныИтог КАК ВТ_ЦеныИтогСебестоимостьИтог
		|		ПО (ВТ_ЦеныИтогСебестоимостьИтог.ТипЦен = &СебестоимостьПрайсЛист)
		|			И ВложенныйЗапрос.Дата = ВТ_ЦеныИтогСебестоимостьИтог.Дата
		|			И ВложенныйЗапрос.Номенклатура = ВТ_ЦеныИтогСебестоимостьИтог.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Основная.Контрагент,
		|	СУММА(Основная.Количество) КАК Количество,
		|	СУММА(Основная.СуммаАвтоматическаяСкидка) КАК СуммаАвтоматическаяСкидка,
		|	СУММА(Основная.СуммаОкругляющейСкидки) КАК СуммаОкругляющейСкидки,
		|	Основная.Контрагент.абс_Отдел КАК Отдел,
		|	Основная.Контрагент.абс_БизнесРегион КАК БизнесРегион,
		|	СУММА(Основная.ВыручкаПоРПЛ) КАК ВыручкаПоРПЛ,
		|	СУММА(Основная.ФактическаяВыручка) КАК ФактическаяВыручка,
		|	СУММА(Основная.РасчетнаяСкидкаПоДоговору) КАК РасчетнаяСкидкаПоДоговору,
		|	СУММА(Основная.ПроизводственнаяCебестоимость) КАК ПроизводственнаяCебестоимость,
		|	СУММА(РучныеСкидкеПоДатеВозникновения.СуммаРучнойСкидки) КАК СуммаРучнойСкидкиПоДатеВозникновения,
		|	ЗначенияСвойствОбъектов.Значение КАК Канал,
		|	""Итог"" КАК Итог,
		|	СУММА(Основная.СуммаРучнойСкидки) КАК СуммаРучнойСкидки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Итог.Контрагент КАК Контрагент,
		|		СУММА(ВТ_Итог.Количество) КАК Количество,
		|		СУММА(ВТ_Итог.СуммаАвтоматическойСкидки) КАК СуммаАвтоматическаяСкидка,
		|		СУММА(ВТ_Итог.СуммаОкругляющейСкидки) КАК СуммаОкругляющейСкидки,
		|		СУММА(ВТ_Итог.ВыручкаПоРПЛ) КАК ВыручкаПоРПЛ,
		|		СУММА(ВТ_Итог.ФактическаяВыручка) КАК ФактическаяВыручка,
		|		СУММА(ВТ_Итог.РасчетнаяСкидкаПоДоговору) КАК РасчетнаяСкидкаПоДоговору,
		|		СУММА(ВТ_Итог.ПроизводственнаяCебестоимость) КАК ПроизводственнаяCебестоимость,
		|		СУММА(ВТ_Итог.СуммаРучнойСкидки) КАК СуммаРучнойСкидки
		|	ИЗ
		|		ВТ_Итог КАК ВТ_Итог
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Итог.Контрагент) КАК Основная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_СкидкаПоДатеВозникновениярасхода.Контрагент КАК Контрагент,
		|			СУММА(ВТ_СкидкаПоДатеВозникновениярасхода.СуммаРучнойСкидки) КАК СуммаРучнойСкидки
		|		ИЗ
		|			ВТ_СкидкаПоДатеВозникновениярасхода КАК ВТ_СкидкаПоДатеВозникновениярасхода
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_СкидкаПоДатеВозникновениярасхода.Контрагент) КАК РучныеСкидкеПоДатеВозникновения
		|		ПО Основная.Контрагент = РучныеСкидкеПоДатеВозникновения.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО Основная.Контрагент = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоКанал)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Канал = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЗначенияСвойствОбъектов.Значение = &Канал
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Основная.Контрагент,
		|	Основная.Контрагент.абс_Отдел,
		|	Основная.Контрагент.абс_БизнесРегион,
		|	ЗначенияСвойствОбъектов.Значение";

		
	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
	Запрос.УстановитьПараметр("ОбщийБазовыйПрайсЛист", ПрайсЛистБазовойВыручки);
	Запрос.УстановитьПараметр("СебестоимостьПрайсЛист", ПрайсЛистСебестоимости);
	Запрос.УстановитьПараметр("СвойствоКанал", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Канал);
	Запрос.УстановитьПараметр("БизнесРегион",БизнесРегион);
	Запрос.УстановитьПараметр("ОтборБизнесРегион", ?(БизнесРегион.Количество()> 0,Истина,Ложь));
	Запрос.УстановитьПараметр("Канал", Канал);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ОтборКонтрагент", ?(Контрагент.Количество()> 0,Истина,Ложь));
	Запрос.УстановитьПараметр("Отдел", Отдел);
    Запрос.УстановитьПараметр("ОтборОтдел", ?(Отдел.Количество()> 0,Истина,Ложь));

	
	РезультатЗапроса = Запрос.Выполнить();

	ТЗ_Результат = РезультатЗапроса.Выгрузить();
	
	Если ТипГруппировки =	"БизнесРегион" Тогда
		ТЗ_Копия = ТЗ_Результат.Скопировать(,"БизнесРегион, СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
		ТЗ_Копия.Свернуть("БизнесРегион","СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
	ИначеЕсли ТипГруппировки =	"Контрагент" Тогда
		ТЗ_Копия = ТЗ_Результат.Скопировать(,"Контрагент, СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
		ТЗ_Копия.Свернуть("Контрагент","СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
	ИначеЕсли ТипГруппировки =	"Канал" Тогда
		ТЗ_Копия = ТЗ_Результат.Скопировать(,"Канал, СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
		ТЗ_Копия.Свернуть("Канал","СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
	ИначеЕсли ТипГруппировки =	"Отдел" Тогда
		ТЗ_Копия = ТЗ_Результат.Скопировать(,"Отдел, СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
		ТЗ_Копия.Свернуть("Отдел","СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
    Конецесли;

	ТЗ_Итог = ТЗ_Результат.Скопировать(,"Итог, СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
	ТЗ_Итог.Свернуть("Итог","СуммаАвтоматическаяСкидка, СуммаОкругляющейСкидки, ВыручкаПоРПЛ, ФактическаяВыручка, РасчетнаяСкидкаПоДоговору, ПроизводственнаяCебестоимость, СуммаРучнойСкидки,СуммаРучнойСкидкиПоДатеВозникновения");
	
	
	Результат.Вывести(ОбластьШапка);
	Результат.ФиксацияСлева = 3;
	ВывестиОбластьДетальныхЗаписей(ТЗ_Итог,ОбластьДетальнаяЗапись,Истина);
    ВывестиОбластьДетальныхЗаписей(ТЗ_Копия,ОбластьДетальнаяЗапись,Ложь);
	
	//Результат.ОтображатьЗаголовки = Истина;
	////Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


Процедура ВывестиОбластьДетальныхЗаписей(ТЗ_Копия,ОбластьДетальнаяЗапись,Итоговая)

	Для каждого СтрокаТЗ из ТЗ_Копия Цикл
		Если  Итоговая Тогда
			ОбластьДетальнаяЗапись.Параметры.ЭлементГруппировки = "Итог";
		ИначеЕсли ТипГруппировки =	"БизнесРегион" Тогда
			ОбластьДетальнаяЗапись.Параметры.ЭлементГруппировки = СтрокаТЗ.БизнесРегион;
		ИначеЕсли ТипГруппировки =	"Контрагент" Тогда
            ОбластьДетальнаяЗапись.Параметры.ЭлементГруппировки = СтрокаТЗ.Контрагент;
		ИначеЕсли ТипГруппировки =	"Канал" Тогда
			ОбластьДетальнаяЗапись.Параметры.ЭлементГруппировки = СтрокаТЗ.Канал;
		ИначеЕсли ТипГруппировки =	"Отдел" Тогда
			ОбластьДетальнаяЗапись.Параметры.ЭлементГруппировки = СтрокаТЗ.Отдел;
		Конецесли;
		
		//Заполняем нулями
		ОбластьДетальнаяЗапись.Параметры.П2РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П21РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П22РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П221РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П222РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П4РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П5РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П6РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П61РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П611РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П612РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П613РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П62РПЛруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П621РПЛруб = 0;
		ОбластьДетальнаяЗапись.Параметры.П622РПЛруб = 0;
		
		ОбластьДетальнаяЗапись.Параметры.П2Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П21Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П22Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П221Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П222Клиентруб	= 0;
		ОбластьДетальнаяЗапись.Параметры.П4Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П5Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П6Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П61Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П611Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П612Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П613Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П62Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П621Клиентруб 	= 0;
		ОбластьДетальнаяЗапись.Параметры.П622Клиентруб 	= 0;
		
		ОбластьДетальнаяЗапись.Параметры.П1РПЛруб 	= СтрокаТЗ.ВыручкаПоРПЛ;
		ОбластьДетальнаяЗапись.Параметры.П21РПЛруб 	= СтрокаТЗ.РасчетнаяСкидкаПоДоговору;
		ОбластьДетальнаяЗапись.Параметры.П221РПЛруб = СтрокаТЗ.СуммаАвтоматическаяСкидка + СтрокаТЗ.СуммаОкругляющейСкидки;
		ОбластьДетальнаяЗапись.Параметры.П222РПЛруб = СтрокаТЗ.СуммаРучнойСкидки;
		ОбластьДетальнаяЗапись.Параметры.П4РПЛруб 	= СтрокаТЗ.ПроизводственнаяCебестоимость;
        ОбластьДетальнаяЗапись.Параметры.П611РПЛруб = СтрокаТЗ.СуммаРучнойСкидкиПоДатеВозникновения;
		
		ОбластьДетальнаяЗапись.Параметры.П21Клиентруб 	= СтрокаТЗ.РасчетнаяСкидкаПоДоговору;
        ОбластьДетальнаяЗапись.Параметры.П221Клиентруб 	= СтрокаТЗ.СуммаАвтоматическаяСкидка + СтрокаТЗ.СуммаОкругляющейСкидки;
		ОбластьДетальнаяЗапись.Параметры.П222Клиентруб 	= СтрокаТЗ.СуммаРучнойСкидки;
        ОбластьДетальнаяЗапись.Параметры.П3Клиентруб 	= СтрокаТЗ.ФактическаяВыручка;
		ОбластьДетальнаяЗапись.Параметры.П4Клиентруб 	= СтрокаТЗ.ПроизводственнаяCебестоимость;
		ОбластьДетальнаяЗапись.Параметры.П611Клиентруб 	= СтрокаТЗ.СуммаРучнойСкидкиПоДатеВозникновения;
		
		ОбластьДетальнаяЗапись.Параметры.П22РПЛруб 	= СтрокаТЗ.СуммаРучнойСкидки + СтрокаТЗ.СуммаАвтоматическаяСкидка + СтрокаТЗ.СуммаОкругляющейСкидки;
		ОбластьДетальнаяЗапись.Параметры.П2РПЛруб 	= СтрокаТЗ.СуммаРучнойСкидки + СтрокаТЗ.СуммаАвтоматическаяСкидка + СтрокаТЗ.СуммаОкругляющейСкидки + СтрокаТЗ.РасчетнаяСкидкаПоДоговору;
		ОбластьДетальнаяЗапись.Параметры.П3РПЛруб 	= ОбластьДетальнаяЗапись.Параметры.П1РПЛруб - ОбластьДетальнаяЗапись.Параметры.П2РПЛруб;
		ОбластьДетальнаяЗапись.Параметры.П5РПЛруб 	= ОбластьДетальнаяЗапись.Параметры.П3РПЛруб - ОбластьДетальнаяЗапись.Параметры.П4РПЛруб;
		ОбластьДетальнаяЗапись.Параметры.П61РПЛруб 	= ОбластьДетальнаяЗапись.Параметры.П611РПЛруб;
		ОбластьДетальнаяЗапись.Параметры.П6РПЛруб 	= ОбластьДетальнаяЗапись.Параметры.П61РПЛруб;
		ОбластьДетальнаяЗапись.Параметры.П7РПЛруб 	= ОбластьДетальнаяЗапись.Параметры.П3РПЛруб + ОбластьДетальнаяЗапись.Параметры.П222РПЛруб - ОбластьДетальнаяЗапись.Параметры.П4РПЛруб - ОбластьДетальнаяЗапись.Параметры.П6РПЛруб;
		ОбластьДетальнаяЗапись.Параметры.П8РПЛруб 	= ?( ОбластьДетальнаяЗапись.Параметры.П1РПЛруб>0,ОбластьДетальнаяЗапись.Параметры.П7РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб *100,0);
		
		ОбластьДетальнаяЗапись.Параметры.П22Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П221Клиентруб + ОбластьДетальнаяЗапись.Параметры.П222Клиентруб;
		ОбластьДетальнаяЗапись.Параметры.П2Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П21Клиентруб + ОбластьДетальнаяЗапись.Параметры.П22Клиентруб;
		ОбластьДетальнаяЗапись.Параметры.П1Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П2Клиентруб + ОбластьДетальнаяЗапись.Параметры.П3Клиентруб;
		ОбластьДетальнаяЗапись.Параметры.П5Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П3Клиентруб - ОбластьДетальнаяЗапись.Параметры.П4Клиентруб;
		ОбластьДетальнаяЗапись.Параметры.П61Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П611Клиентруб ;
		ОбластьДетальнаяЗапись.Параметры.П6Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П61Клиентруб ;
		ОбластьДетальнаяЗапись.Параметры.П7Клиентруб 	= ОбластьДетальнаяЗапись.Параметры.П3Клиентруб + ОбластьДетальнаяЗапись.Параметры.П222Клиентруб - ОбластьДетальнаяЗапись.Параметры.П4Клиентруб - ОбластьДетальнаяЗапись.Параметры.П6Клиентруб;
		ОбластьДетальнаяЗапись.Параметры.П8Клиентруб 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб>0, ОбластьДетальнаяЗапись.Параметры.П7Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб *100,0);
		
        ОбластьДетальнаяЗапись.Параметры.П2РПЛпроц 		= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П2РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П21РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П21РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П22РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П22РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П221РПЛпроц	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П221РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П222РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П222РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П4РПЛпроц 		= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П4РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П5РПЛпроц 		= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П5РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П6РПЛпроц 		= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П6РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П61РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П61РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П611РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П611РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П612РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П612РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П613РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П613РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П62РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П62РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П621РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П621РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П622РПЛпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1РПЛруб >0 ,ОбластьДетальнаяЗапись.Параметры.П622РПЛруб / ОбластьДетальнаяЗапись.Параметры.П1РПЛруб * 100,0);
		
		ОбластьДетальнаяЗапись.Параметры.П2Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П2Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П21Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П21Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П22Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П22Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П221Клиентпроц	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П221Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П222Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П222Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П4Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П4Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П5Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П5Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П6Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П6Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П61Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П61Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П611Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П611Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П612Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П612Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П613Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П613Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П62Клиентпроц 	= ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П62Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П621Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П621Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		ОбластьДетальнаяЗапись.Параметры.П622Клиентпроц = ?(ОбластьДетальнаяЗапись.Параметры.П1Клиентруб >0 ,ОбластьДетальнаяЗапись.Параметры.П622Клиентруб / ОбластьДетальнаяЗапись.Параметры.П1Клиентруб * 100,0);
		
		
		Результат.Присоединить(ОбластьДетальнаяЗапись);
	КонецЦикла;
	
КонецПроцедуры
